trade_exp/src/InformationRegisters/СтоимостьРазгрузки/СтоимостьРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d54f98f9-51ce-4356-9b5a-3c7b8f62b529">
  <name>СтоимостьРазгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="9e2d4638-9560-4085-b799-fe012b588958">
    <name>ЦенаДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e6fc1242-c954-40f4-b5e8-a1ffd899e453">
    <name>ЦенаДляКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6b081896-1908-4005-8b4b-4c28e017e88c">
    <name>ВремяРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ea4e457c-a051-4001-816d-f9753d70775e">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="e82dfc88-2a4b-4972-9b11-c483a036475c">
    <name>Этаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c0cb660d-1ef2-4e88-8439-152ff3e32cd6">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f94ac501-14b4-4d3c-9caa-8516f2fe5421">
    <name>Негабарит</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СтоимостьРазгрузки/Forms/ФормаЗагрузки/Module.bsl
&НаСервере
Функция ЗагрузитьНаСервере()
	
	ЕстьОшибки = Ложь;
	
	Если Не ЗначениеЗаполнено(Зона) Тогда
		Сообщить("Зона не заполнена!");
		Возврат Истина;
	КонецЕсли;
	
	НомерСтроки = 2;
	ЦветОшибка= Новый Цвет(255,0,0);
	
	Пока Истина Цикл
		
		НомерКолонки = 2;
		
		стрНомерСтроки= Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		стрВесТовара = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").Текст);
		
		Если ПустаяСтрока(стрВесТовара) Тогда 
			Прервать;
		КонецЕсли;
		
		Пока Истина Цикл
			
			Ошибка= Ложь;
			
			стрНомерКолонки= Формат(НомерКолонки, "ЧРГ=; ЧГ=0");
			
			стрНомерЭтажа = СокрЛП(ТабличныйДокумент.Область("R1C"+стрНомерКолонки).Текст);
			
			Если ПустаяСтрока(стрНомерЭтажа) Тогда 
				Прервать;
			КонецЕсли;
			
			стрСтоимостьРазгрузки = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C"+стрНомерКолонки).Текст);
			
			Если Не ЗначениеЗаполнено(стрСтоимостьРазгрузки) Тогда
				Ошибка= Истина;
				ТабличныйДокумент.Область("R"+стрНомерСтроки+"C"+стрНомерКолонки).ЦветФона= ЦветОшибка;
			КонецЕсли;
			
			Попытка
				ЗначениеРесурса = Число(стрСтоимостьРазгрузки);
			Исключение
				Ошибка= Истина;
				ТабличныйДокумент.Область("R"+стрНомерСтроки+"C"+стрНомерКолонки).ЦветФона= ЦветОшибка;
			КонецПопытки;
			
			Попытка
				ВесТовара= Число(стрВесТовара);
			Исключение
				Ошибка= Истина;
				ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветОшибка;
			КонецПопытки;
			
			Попытка
				НомерЭтажа= Число(стрНомерЭтажа);
			Исключение
				Ошибка= Истина;
				ТабличныйДокумент.Область("R1C"+стрНомерКолонки).ЦветФона= ЦветОшибка;
			КонецПопытки;
			
			Если Не Ошибка Тогда
				НаборЗаписей= РегистрыСведений.СтоимостьРазгрузки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Дата);
				НаборЗаписей.Отбор.Вес.Установить(ВесТовара);
				НаборЗаписей.Отбор.Этаж.Установить(НомерЭтажа);
				НаборЗаписей.Отбор.Зона.Установить(Зона);
				НаборЗаписей.Отбор.Негабарит.Установить(Негабарит);

				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
					НоваяЗапись= НаборЗаписей.Добавить();
				Иначе
					НоваяЗапись= НаборЗаписей[0];
				КонецЕсли;
				
				
				НоваяЗапись.Период= Дата;
				НоваяЗапись.Вес= ВесТовара;
				НоваяЗапись.Этаж= НомерЭтажа;
				НоваяЗапись.Зона= Зона;
				НоваяЗапись.Негабарит= Негабарит;
				НоваяЗапись[ИмяРесурса]= ЗначениеРесурса;
				
				Попытка
					НаборЗаписей.Записать();
				Исключение
					ЕстьОшибки = Истина;
				КонецПопытки;
			Иначе
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			НомерКолонки= НомерКолонки+1;
		КонецЦикла;
		
		НомерСтроки= НомерСтроки+1;
	КонецЦикла;

	Возврат ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
		
	ЕстьОшибкиПриЗагрузки = ЗагрузитьНаСервере();
	
	Если Не ЕстьОшибкиПриЗагрузки Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
